# Pandas

In [60]:
'''
1.series
2.dataframe

'''

'\n1.series\n2.dataframe\n\n'

!pip install pandas 
for cmd no need !

In [61]:
import pandas as pd

In [62]:
print(pd.__version__)

1.5.3

# Series

like a column in a table .
it is like a one dimensional array but more powerful

In [63]:
list=[1,2,3,4,5]
label=['a','b','c','d','e']

In [64]:
list,label

([1, 2, 3, 4, 5], ['a', 'b', 'c', 'd', 'e'])

In [65]:
type(list),type(label)

(list, list)

In [66]:
ser=pd.Series(list)
ser

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [67]:
#diff b/w series and numpy array

In [68]:
ser=pd.Series(list,index=label)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [69]:
#if no.of rows is more than 5000 pandas is better
#if it is less than 5000 numpy arrays are used.

#numpy arrays are faster, but still pandas are preferred

In [70]:
Marks={"maths":43,'science':80,"physics":46,"chemistry":95}
Ser=pd.Series(Marks)
Ser

maths        43
science      80
physics      46
chemistry    95
dtype: int64

In [71]:
#to show only series of maths sci and phy alone

In [72]:
Ser=pd.Series(Marks,index=["maths","science","physics"])

In [73]:
Ser

maths      43
science    80
physics    46
dtype: int64

In [74]:
#Series Index

In [75]:
Ser[1:3]

science    80
physics    46
dtype: int64

In [77]:
Ser[1:2]

science    80
dtype: int64

In [78]:
Ser.shape

(3,)

In [79]:
type(Ser)

pandas.core.series.Series

In [80]:
import numpy as np
arr=np.array(list)

In [81]:
arr

array([1, 2, 3, 4, 5])

In [82]:
arr.shape

(5,)

In [2]:
import numpy as np
arr=np.array([[1,2,3],[4,5,6]])

In [84]:
arr

array([[1, 2, 3],
       [4, 5, 6]])

In [3]:
arr.shape

(2, 3)

In [4]:
arr.reshape(3,2)

array([[1, 2],
       [3, 4],
       [5, 6]])

In [9]:
arr.reshape(6,)

array([1, 2, 3, 4, 5, 6])

# Dataframe

In [88]:
list=[[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]]

In [89]:
df=pd.DataFrame(list)

In [90]:
df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [91]:
colums=["a","b","c","d"]

In [92]:
df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [93]:
labels=["A","B","C","D"]#rows

In [94]:
df=pd.DataFrame(list,index=labels,columns=colums)

In [95]:
df

    a   b   c   d
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16

In [96]:
df=pd.DataFrame({"Name":["Surya","Arya","Ajay"],"Age":[12,13,14],"Branch":["AI","ML","EXE"]})

In [97]:
df

    Name  Age Branch
0  Surya   12     AI
1   Arya   13     ML
2   Ajay   14    EXE

In [98]:
type(df)

pandas.core.frame.DataFrame

In [99]:
df.shape

(3, 3)

In [100]:
df.reshpae(9,0)

AttributeError: 'DataFrame' object has no attribute 'reshpae'

In [101]:
df.columns

Index(['Name', 'Age', 'Branch'], dtype='object')

In [102]:
df.rows

AttributeError: 'DataFrame' object has no attribute 'rows'

In [103]:
df.rename(columns={"Name":"Nameing bro"})

  Nameing bro  Age Branch
0       Surya   12     AI
1        Arya   13     ML
2        Ajay   14    EXE

In [104]:
df.columns[[2,1]]

Index(['Branch', 'Age'], dtype='object')

In [105]:
df.columns.values

array(['Name', 'Age', 'Branch'], dtype=object)

In [106]:
df.columns.values[2]="New_branch"

In [107]:
df

    Name  Age New_branch
0  Surya   12         AI
1   Arya   13         ML
2   Ajay   14        EXE

In [108]:
df1=df.drop("Name",axis=1)
#axis = 1 is columns
#axis = 0 is for rows
df1

   Age  New_branch
0   12         NaN
1   13         NaN
2   14         NaN

In [109]:
df.drop("Name",axis=1)

   Age  New_branch
0   12         NaN
1   13         NaN
2   14         NaN

In [110]:
#for committing the changes
# df.drop("Name",axis=1,inplace=True)

In [111]:
df["place"]=["hyd","gnt","cbe"]

In [112]:
df

    Name  Age New_branch place
0  Surya   12         AI   hyd
1   Arya   13         ML   gnt
2   Ajay   14        EXE   cbe

In [113]:
df.drop("Age",axis=0)

KeyError: "['Age'] not found in axis"

In [114]:
df=pd.DataFrame({"Name":["Surya","Arya","Ajay"],"Age":[12,13,14],"Branch":["AI","ML","EXE"]})

In [115]:
df1=pd.DataFrame({"Name":["a","b","c"],"Age":[2,3,4],"Branch":["cse","ece","ai"]})

In [116]:
df1,df

(  Name  Age Branch
 0    a    2    cse
 1    b    3    ece
 2    c    4     ai,
     Name  Age Branch
 0  Surya   12     AI
 1   Arya   13     ML
 2   Ajay   14    EXE)

In [117]:
df

    Name  Age Branch
0  Surya   12     AI
1   Arya   13     ML
2   Ajay   14    EXE

In [118]:
df1

  Name  Age Branch
0    a    2    cse
1    b    3    ece
2    c    4     ai

In [119]:
df+df1

     Name  Age Branch
0  Suryaa   14  AIcse
1   Aryab   16  MLece
2   Ajayc   18  EXEai

In [120]:
df3=pd.concat([df,df1])
df3

    Name  Age Branch
0  Surya   12     AI
1   Arya   13     ML
2   Ajay   14    EXE
0      a    2    cse
1      b    3    ece
2      c    4     ai

In [121]:
df[0]

KeyError: 0

In [122]:
df3=pd.concat([df,df1],ignore_index="True")

In [123]:
df3

    Name  Age Branch
0  Surya   12     AI
1   Arya   13     ML
2   Ajay   14    EXE
3      a    2    cse
4      b    3    ece
5      c    4     ai

In [124]:
df1["place"]=["hyd","cbe",'gnt']

In [125]:
df3=pd.concat([df,df1],ignore_index="True")

In [126]:
df3

    Name  Age Branch place
0  Surya   12     AI   NaN
1   Arya   13     ML   NaN
2   Ajay   14    EXE   NaN
3      a    2    cse   hyd
4      b    3    ece   cbe
5      c    4     ai   gnt

# handling with missing values

# i.e, removing NaN

1. deleting the row
   deleting the column
   
2. imputing the values
   i.e, filling the NaN with some value

10000 records
    50 records(rows) with null values-----delete the rows
    5000 rows have null------??? ---- imputing
    
    70-80% is null in a column, then delete that column

In [127]:
df3

    Name  Age Branch place
0  Surya   12     AI   NaN
1   Arya   13     ML   NaN
2   Ajay   14    EXE   NaN
3      a    2    cse   hyd
4      b    3    ece   cbe
5      c    4     ai   gnt

In [128]:
df.columns.values[2]

'Branch'

In [129]:
df.columns[2]

'Branch'

In [130]:
import numpy as np
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [131]:
#to check for null values

df1.isnull()

#returns true where there is null

    Name  score1  score2
0  False   False    True
1   True   False   False
2  False    True   False
3   True    True    True
4  False   False   False
5  False   False   False

In [132]:
df1.isnull().any()

#will return the column that has a null values

Name      True
score1    True
score2    True
dtype: bool

In [133]:
#to find no.of null values

df1.isnull().sum()

Name      2
score1    2
score2    2
dtype: int64

# 1. deleting

1. deleting the rows containing null values

In [134]:
df1.dropna()

     Name  score1  score2
4  saanvi     4.0     4.0
5  saanvi     5.0     5.0

In [135]:
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [136]:
df1.dropna(inplace=True)

In [137]:
df1

     Name  score1  score2
4  saanvi     4.0     4.0
5  saanvi     5.0     5.0

In [138]:
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})

In [139]:
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

2. deleting the columns

In [140]:
df1.dropna(axis=1,inplace=True)

In [141]:
df1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

# 2. imputing

1 2 3 4 5 5
Mean 1+2+3+4+5+5/6
Median 3+4/2
Mode 5

In [142]:
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})

In [143]:
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [144]:
df1["score1"]=df1["score1"].fillna(df1["score1"].mean())
#imputing with means

In [145]:
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [146]:
df1["score2"]=df1["score2"].fillna(df1["score2"].median())
#imputing with medians

In [147]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [148]:
df1["Name"]=df1["Name"].fillna(df1["Name"].mode())
#if categorical nulls are present,
#like names,

#make use of modes

In [149]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [150]:
df1["Name"].mode()

0    saanvi
Name: Name, dtype: object

In [151]:
type(df1["Name"].mode())

pandas.core.series.Series

In [152]:
#since mode is returning a series, use the 0th index to replace

In [153]:
df1["Name"]=df1["Name"].fillna(df1["Name"].mode()[0])

In [154]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [155]:
df1["Name"].mode()

0    saanvi
Name: Name, dtype: object

In [156]:
df1.Name.value_counts()

saanvi     4
tulasi     1
supriya    1
Name: Name, dtype: int64

In [157]:
#grouping

In [158]:
group=df1.groupby("Name")
group

In [159]:
group.mean()

         score1  score2
Name
saanvi    4.375    4.75
supriya   4.500    9.00
tulasi    5.000    5.00

In [160]:
group.median()

         score1  score2
Name
saanvi     4.25     5.0
supriya    4.50     9.0
tulasi     5.00     5.0

In [161]:
group.mode()

AttributeError: 'DataFrameGroupBy' object has no attribute 'mode'

In [ ]:
df1.shape

In [162]:
#to return the first rows
df1.head(3)

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0

In [163]:
df1.tail(4)

      Name  score1  score2
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

# Accessing the rows and columns

loc
and
iloc

loc is location
to return one or more specified rows

In [164]:
df1.loc[0]

Name      tulasi
score1       5.0
score2       5.0
Name: 0, dtype: object

In [165]:
type(df1.loc[0])

pandas.core.series.Series

In [166]:
df2=df1.loc[0]

In [167]:
df2

Name      tulasi
score1       5.0
score2       5.0
Name: 0, dtype: object

In [168]:
type(df2)

pandas.core.series.Series

In [169]:
df1.loc[0:2]

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0

In [170]:
df1.iloc[0]

Name      tulasi
score1       5.0
score2       5.0
Name: 0, dtype: object

In [171]:
df1.iloc[0:3]

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0

In [172]:
data={
    "calories":[420,125,154],
    "duration":[50,40,45]
}

In [173]:
type(data),data

(dict, {'calories': [420, 125, 154], 'duration': [50, 40, 45]})

In [174]:
df=pd.DataFrame(data,index=["day1","day2","day3"])

In [175]:
df

      calories  duration
day1       420        50
day2       125        40
day3       154        45

In [176]:
type(df)

pandas.core.frame.DataFrame

In [177]:
dir(df)

['T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__dataframe__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_add_numeric_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_align_frame',
 '_align_series',
 '_append',
 '_arith_method',
 '_as_manager',
 '_attrs',
 '_box_col_values',
 '_can_fast_transpose',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_data',
 '_dir_additions',
 '_dir_deletions',
 '_dispatch_frame_op',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_flags',
 '_from_arrays',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_gotitem',
 '_hidden_attrs',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_iset_item',
 '_iset_item_mgr',
 '_iset_not_inplace',
 '_item_cache',
 '_iter_column_arrays',
 '_ixs',
 '_join_compat',
 '_logical_func',
 '_logical_method',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_mgr',
 '_min_count_stat_function',
 '_needs_reindex_multi',
 '_protect_consolidate',
 '_reduce',
 '_reduce_axis1',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_rename',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_series',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_item',
 '_set_item_frame_value',
 '_set_item_mgr',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_stat_function',
 '_stat_function_ddof',
 '_take',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'calories',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'duration',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isetitem',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_flags',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_orc',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'to_xml',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs']

In [178]:
df.loc["day2"]

calories    125
duration     40
Name: day2, dtype: int64

In [180]:
df[calories]

NameError: name 'calories' is not defined

loc-----labelled indices
iloc----integer based indices

In [181]:
df=pd.DataFrame({"Name":["vishwa","Saanvi","chetan","priya"],"Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"]})

In [182]:
df

     Name  Age Branch
0  vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [184]:
df.iloc[1:3,0:2]

     Name  Age
1  Saanvi    5
2  chetan   10

In [185]:
df.iloc[2: ,1:]

   Age Branch
2   10    ECE
3   15    EEE

In [188]:
df.iloc[3: , :1]

    Name
3  priya

In [191]:
#to grab name and branch
df.iloc[:,[0,2]]

     Name Branch
0  vishwa     AI
1  Saanvi     ML
2  chetan    ECE
3   priya    EEE

In [194]:
#grabbing two columns but with loc
df.loc[: ,["Name","Branch"]]

     Name Branch
0  vishwa     AI
1  Saanvi     ML
2  chetan    ECE
3   priya    EEE

so basically loc works on index names
but iloc works on interger indices

that i in iloc represents intergers